IdeaRS.OpenModel.Message.OpenMessages
Open messages collection

IdeaRS.OpenModel.Message.OpenMessages.#ctor
Constructor

IdeaRS.OpenModel.Message.OpenMessages.Add(IdeaRS.OpenModel.Message.OpenMessage)
Add a message
message: Message to be added

IdeaRS.OpenModel.Message.OpenMessages.Messages
List of messages

IdeaRS.OpenModel.Message.OpenMessages.ErrorMessages
List Error messages only

IdeaRS.OpenModel.Message.OpenMessages.WarningMessages
List Worning messages only

IdeaRS.OpenModel.Message.OpenMessages.InformationMessages
List Information messages only